Update overall structure of README.md
Changed language to English for universal undertanding.
Add mermaid flowcharts for better visibility.
